tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"

brew "ack"
brew "autojump"
brew "bat"
brew "ctop"
# brew "coreutils"
brew "diff-so-fancy"
brew "git"
brew "autojump"
brew "fzf"
brew "mas"
brew "spaceship"
brew "stow"
brew "tree"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# fonts 
cask "font-jetbrains-mono"
cask "font-roboto"

# essentials
cask "adobe-creative-cloud"
cask "google-chrome"
cask "firefox"
cask "iina"
cask "iterm2"
cask "keka"
cask "keepasxc"
cask "xnviewmp"
cask "visual-studio-code"

# office
cask "libreoffice"

# messaging
cask "telegram"
cask "signal"
